### Terraform Summary
#### 🖌 Format: `failure`
<details><summary>Show format issues</summary>```
400-gke-iam.tf
400-gke-network.tf
```</details>
#### 📖 Plan:   `success`
<details><summary>Show Plan</summary>```
[0m[1mgoogle_project.project: Refreshing state... [id=projects/arikkfir][0m
[0m[1mgoogle_service_account.gha-arikkfir-infrastructure: Refreshing state... [id=projects/arikkfir/serviceAccounts/gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.apis["containerfilesystem.googleapis.com"]: Refreshing state... [id=arikkfir/containerfilesystem.googleapis.com][0m
[0m[1mgoogle_project_service.apis["containerregistry.googleapis.com"]: Refreshing state... [id=arikkfir/containerregistry.googleapis.com][0m
[0m[1mgoogle_project_service.apis["storage-component.googleapis.com"]: Refreshing state... [id=arikkfir/storage-component.googleapis.com][0m
[0m[1mgoogle_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=arikkfir/artifactregistry.googleapis.com][0m
[0m[1mgoogle_storage_bucket.arikkfir-devops: Refreshing state... [id=arikkfir-devops][0m
[0m[1mgoogle_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=arikkfir/dns.googleapis.com][0m
[0m[1mgoogle_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=arikkfir/logging.googleapis.com][0m
[0m[1mgoogle_project_service.apis["servicemanagement.googleapis.com"]: Refreshing state... [id=arikkfir/servicemanagement.googleapis.com][0m
[0m[1mgoogle_project_service.apis["container.googleapis.com"]: Refreshing state... [id=arikkfir/container.googleapis.com][0m
[0m[1mgoogle_project_service.apis["cloudbilling.googleapis.com"]: Refreshing state... [id=arikkfir/cloudbilling.googleapis.com][0m
[0m[1mgoogle_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=arikkfir/compute.googleapis.com][0m
[0m[1mgoogle_project_service.apis["oslogin.googleapis.com"]: Refreshing state... [id=arikkfir/oslogin.googleapis.com][0m
[0m[1mgoogle_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=arikkfir/iamcredentials.googleapis.com][0m
[0m[1mgoogle_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=arikkfir/pubsub.googleapis.com][0m
[0m[1mgoogle_project_service.apis["storage-api.googleapis.com"]: Refreshing state... [id=arikkfir/storage-api.googleapis.com][0m
[0m[1mgoogle_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=arikkfir/bigquery.googleapis.com][0m
[0m[1mgoogle_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=arikkfir/monitoring.googleapis.com][0m
[0m[1mgoogle_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=arikkfir/iam.googleapis.com][0m
[0m[1mgoogle_project_service.apis["bigquerystorage.googleapis.com"]: Refreshing state... [id=arikkfir/bigquerystorage.googleapis.com][0m
[0m[1mgoogle_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=arikkfir/serviceusage.googleapis.com][0m
[0m[1mgoogle_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=arikkfir/secretmanager.googleapis.com][0m
[0m[1mgoogle_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=arikkfir/cloudresourcemanager.googleapis.com][0m
[0m[1mgoogle_project_iam_member.gha-arikkfir-infrastructure-iam-serviceAccountAdmin: Refreshing state... [id=arikkfir/roles/iam.serviceAccountAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-objectAdmin: Refreshing state... [id=b/arikkfir-devops/roles/storage.objectAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-resourcemanager-organizationViewer: Refreshing state... [id=468825984716/roles/resourcemanager.organizationViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-admin: Refreshing state... [id=b/arikkfir-devops/roles/storage.admin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.gha-arikkfir-infrastructure-browser: Refreshing state... [id=arikkfir/roles/browser/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-iam-organizationRoleViewer: Refreshing state... [id=468825984716/roles/iam.organizationRoleViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.gha-arikkfir-infrastructure-serviceusage-serviceUsageAdmin: Refreshing state... [id=arikkfir/roles/serviceusage.serviceUsageAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_network.gke[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "gke" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = false
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mdescription[0m[0m                     = "GKE VPC"
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                            = "gke"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = "arikkfir"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[1m  # google_compute_subnetwork.gke-subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "gke-subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.100.0.0/16"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "gke-subnet-europe-west3"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "arikkfir"
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "europe-west3"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = [
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "10.110.0.0/17"
              [32m+[0m [0mrange_name    = "gke-pods"
            },
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "10.110.128.0/17"
              [32m+[0m [0mrange_name    = "gke-services"
            },
        ]
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # google_project_iam_member.gke-node-logging-logWriter[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_member" "gke-node-logging-logWriter" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "arikkfir"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/logging.logWriter"
    }

[1m  # google_project_iam_member.gke-node-monitoring-metricWriter[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_member" "gke-node-monitoring-metricWriter" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "arikkfir"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/monitoring.metricWriter"
    }

[1m  # google_service_account.config-connector[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account" "config-connector" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "config-connector"
      [32m+[0m [0m[1m[0mdisabled[0m[0m     = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "GKE Config Connector"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = "arikkfir"
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # google_service_account.gke-node[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account" "gke-node" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "gke-node"
      [32m+[0m [0m[1m[0mdisabled[0m[0m     = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "GKE nodes service account"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = "arikkfir"
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # google_service_account_iam_member.config_connector_workload_identity[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account_iam_member" "config_connector_workload_identity" {
      [32m+[0m [0m[1m[0metag[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m             = "serviceAccount:arikkfir.svc.id.goog[cnrm-system/cnrm-controller-manager]"
      [32m+[0m [0m[1m[0mrole[0m[0m               = "roles/iam.workloadIdentityUser"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = (known after apply)
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m```</details>